---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.MultiServerService.ExecutionPolicy
source: html/9adbb787-5848-e0f2-2a27-4fb5d4c1f73f.htm
---
# Autodesk.Revit.DB.ExternalService.MultiServerService.ExecutionPolicy Property

Specifies how a multi-server service executes servers during its execution.

## Syntax (C#)
```csharp
public ExecutionPolicy ExecutionPolicy { get; }
```

## Remarks
Read descriptions for the items in the ExecutionPolicy enum
 to find out details about all applicable execution policies.